// Задача необязательная 1: 
// на входе целое или вещественное число, 
// надо удалить вторую цифру слева целой части этого числа.

// 145 -> 15
// 1 -> нет
// 567,123 -> 57,123

int num = new Random().Next();
double r = Convert.ToDouble(x.Next(-10000, 10000)/10000.0);
System.Console.WriteLine(r);