// // Напишите программу, кторая выводит третью цифру заданного числа 
// // или сообщает, что третьей цифры нет.
// // 645 -> 5
// // 78 -> третьей цифры нет
// // 32679 -> 6

// Console.WriteLine("Введите число");
// int num1 = Convert.ToInt32(Console.ReadLine());

// while (num1 > 999)
// {
//     num1 = num1 / 10;
// }

// if (num1 <= 99)
// {
//     Console.WriteLine("третьей цифры нет");
// }
// else
// {
//     num1 = num1 % 10;
//     Console.WriteLine(num1);
// }