// // Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа. 
// // Через строку решать нельзя.

// // 456 -> 5
// // 782 -> 8
// // 918 -> 1

// int num = new Random().Next(100, 999);
// System.Console.WriteLine(num);

// int num2 = num % 100 / 10;




// System.Console.WriteLine(num2);